# AdvancedTransparent Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedTransparent Class
Members See Also
---
A static class that provides access to the property names that appear in the AdvancedTransparent visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class AdvancedTransparent
```

Visual Basic
---
```text
Public NotInheritable Class AdvancedTransparent
```

Visual C++
---
```text
public ref class AdvancedTransparent abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AdvancedTransparent
# See Also
AdvancedTransparent Members
Autodesk.Revit.DB.Visual Namespace